---
kind: property
id: P:Autodesk.Revit.DB.Visual.Speckle.TextureRealWorldOffsetY
source: html/27aba2cd-0ea0-65da-7a63-c7d3a0496b76.htm
---
# Autodesk.Revit.DB.Visual.Speckle.TextureRealWorldOffsetY Property

The property labeled "Offset Y" from the "Speckle" schema.

## Syntax (C#)
```csharp
public static string TextureRealWorldOffsetY { get; }
```

## Remarks
This property is of type "AssetPropertyDistance".